from gtts import gTTS

def hindi_audio_generator(hindi_news_list):
    # Define the text to be converted to speech
    for index, item in enumerate(hindi_news_list):

        # Create a gTTS object and specify the language
        tts = gTTS(text=item, lang='hi')

        # Save the audio file
        tts.save(f"{item}.mp3")

hindi_wish_list = ["नमस्कार, मैं  प्रगति आपका एक बार फिरसे स्वागत करती हु न्यूज़ रीडर में, आज के सामान्य समाचार कुछ इस प्रकार है",
                   "नमस्कार, मैं  प्रगति आपका एक बार फिरसे स्वागत करती हु न्यूज़ रीडर में, आज के व्यापार समाचार कुछ इस प्रकार है",
                   "नमस्कार, मैं  प्रगति आपका एक बार फिरसे स्वागत करती हु न्यूज़ रीडर में, आज के खेल समाचार कुछ इस प्रकार है",
                   "नमस्कार, मैं  प्रगति आपका एक बार फिरसे स्वागत करती हु न्यूज़ रीडर में, आज के मनोरंजन समाचार कुछ इस प्रकार है",
                   "नमस्कार, मैं  प्रगति आपका एक बार फिरसे स्वागत करती हु न्यूज़ रीडर में, आज के स्वास्थय समाचार कुछ इस प्रकार है",
                   "नमस्कार, मैं  प्रगति आपका एक बार फिरसे स्वागत करती हु न्यूज़ रीडर में, आज के प्रोद्योगिक समाचार कुछ इस प्रकार है",
                   "नमस्कार, मैं  प्रगति आपका एक बार फिरसे स्वागत करती हु न्यूज़ रीडर में, आज के विज्ञान समाचार कुछ इस प्रकार है",
                   "आज के मुख्य समाचार समाप्त हुए , धन्यवाद"]

hindi_audio_generator(hindi_wish_list)